var store = [{
        "title": "Hello World",
        "excerpt":"私のブログへようこそ！   ずっと前から個人サイトとブログを作ろうと思ったのですが、中々時間が作れなくて、今まで手を付けれなかったです。今はバンクーバーの帰省中なので、やっと少しでも余裕があって早速作っちゃいました！    バンクーバー公立図書館の屋上からの眺めです（ダウンタウン・バンクーバー、カナダ）   主に興味のある話題（テック業界、サイバーセキュリティ、心理学、キャリア・自己改善、語学、読んだ本の感想、日本での生活、など）について書こうと思います。   近々に投稿する予定の記事：     最近退職したメルカリで過ごした間のレトロスペクティブ   人生初めて複数の会社から内定をもらって、給与を交渉した経験   最近読んで、良かったなと思っておすすめしたい本   このブログはレディーメードのデザインを使用しているので少しダサいかもしれないので、次は以下の改善をしたいと思います：     デザインをカスタマイズして、UIを綺麗にする   日本語と中国語の翻訳を書く（注意：この二つの言語を練習するために自分で記事を書いてみようと思っているので、質が悪い翻訳になったら申し訳ありません…）   プロフィールにツイッターとLinkedInのハンドルを残したので、投稿についてコメントや感想、書いてほしい話題、アイデア、提案などがあれば、是非気軽にご連絡ください。   ご精読をありがとうございました。では、また次の投稿で！    バンクーバーの美味しい点心を楽しんでいます！本格的な中華料理を食べるのは本当に久しぶりです（泣）  ","categories": [],
        "tags": ["ランダム"],
        "url": "/blog/2022/06/22/hello-world.html",
        "teaser": null
      },{
        "title": "メルカリを卒業しました！",
        "excerpt":"先月、5年近く勤めてきた株式会社メルカリを卒業しました！ メルカリはCraigslistやEbayのようなフリマアプリです。 私は2017年11月1日にメルカリに入社しました。日本での初めての会社で、将来の事が分からなくて、とりあえず一年半や二年間ぐらいいようと思ってジョインしましたが、結局5年近くいるなんて想像もしなかったです！入社してから4年9ヵ月間が経って、ようやく6月14日に最終出社日を迎えました。 入社した当時の私と今の私を比べると、もはや別人だと言えるぐらい成長してきた気がします。この数年間の振り返りとしてこの記事を書きました。 タイムライン 2017年11月～2018年10月：SETと自動化テスト時代 最初は、自動化テストを担当する「Software in Test (SET)」として入社しました。 当時に使った技術スタック： iOS: XCUITest, Swift, Earl Grey Android: Ruby, Appium API: JMeter, Postman 主な達成： iOSの自動化テストを開発リポジトリとCIパイプラインに導入しました iOS自動化テストのnightly buildを設定しました テスト結果のリポートを改善しました fastlane plugin を開発して、オープンソースしました 「ISTQB Advanced - Test Automation Engineer」が受かりました 2018年10月～2019年7月：Testdeck時代 メルカリはマイクロサービス・アーキテクチャへの移行が始まった頃、マイクロサービスのテストができる社内ツールを作る必要になって、私はそのプロジェクトに入りました。結果として、Testdeck というツールを開発して、こちらの記事 で説明したようにオープンソースしました。 主な達成： プロジェクトに貢献するためにマイクロサービス・アーキテクチャ、Kubernetes、GCP、Go などを学んで、最終にTestdeckのリードになりました マイクロサービスの開発チームと親しく働いて、自動化テストの導入、トラブルシュート、Testdeckのフィーチャーリクエストや改善などで、開発チームをサポートしました 2019年7月～2019年9月：ウェブ自動化テストとキャリアチェンジ時代 この数か月間、メルカリのウェブアプリの自動化テストをサポートしながら、キャリアについて次のステップを考えました。セキュリティを真剣に勉強し始めたことも、セキュリティチームに異動する内定をもらったことも、この時期でした。 主な達成： ウェブの自動化テストのメインテナンスをサポートしました（TypescriptとMocha） ウェブアプリのリンク切れを毎晩に検出する社内ツールを開発しました 「CompTIA...","categories": [],
        "tags": ["メルカリ","キャリア"],
        "url": "/blog/2022/07/14/mercari-retrospective.html",
        "teaser": null
      }]
